{
	"fixes":
	{
		"quickShot":
		{
			"quickShot":					true,	/* Calculate the power of arrows fired by the player using the Quick Shot perk. */
			"playbackSpeed":				2.0		/* The playback speed of the nocking animation when the player has the Quick Shot perk. */
		},
		"activateFurniture":				true,	/* Prevent the camera from breaking when activating furniture while mounted. */
		"actorValuePercentage":				true,	/* Calculate percentages of actor values using permanent and also temporary modifiers. */
		"enchantmentCost":					true,	/* Save the charge and value of player created enchantments. */
		"hitEffectRaceCondition":			true,	/* Remove a race condition that can prevent hit effects from being attached when actors are loaded. */
		"ingredientRespawn":				true,	/* Save whether the ingredients that have been harvested from flora and trees have respawned. */
		"impactEffectCrash":				true,	/* Prevent a crash that occurs when loading save games that have impact effects with uninstalled texture sets. */
		"isCurrentSpell":					true,	/* Restore the IsCurrentSpell condition and console command. */
		"killCamera":						true,	/* Prevent handling the Apply Combat Hit Spell perk entry point when the kill camera simulates the trajectory of arrows. */
		"leftHandPowerAttacks":				true,	/* Calculate the stamina required to perform left handed power attacks using left handed weapons. */
		"magicEffectFlags":					false,	/* Respect magic effect flags when power affects duration and magnitude. */
		"modifyArmorWeightPerkEntryPoint":	true,	/* The weight of only worn armor is modified by the Mod Armor Weight perk entry point. */
		"powerCooldowns":					true,	/* Save the cooldowns of all powers. */
		"projectileFadeDuration":			true,	/* Projectiles that fade before updating are also destroyed. */
		"terrainImpactEffects":				true,	/* Play impact effects on terrain even in cells that have been partially unloaded. */
		"trainingMenu":						true,	/* The training menu shows the correct cost of lessons when the skill is buffed or debuffed. */
		"weaponCharge":						true	/* Magic effects can always completely recharge equipped enchanted weapons. */
	},
	"patches":
	{
		"difficultyMultipliers":
		{
			"commandedActors":				false,	/* Reanimated thralls and summoned creatures use the same difficulty multipliers as the player. */
			"teammates":					false	/* Teammates use the same difficulty multipliers as the player. */
		},
		"perkEntryPoints":
		{
			"applySpells":					false,	/* Apply any number of spells at once using perk entry points. */
			"castSpells":					true	/* Spells applied by perk entry points are cast on the target by the source and not the target. */
		},
		"soulGems":
		{
			"black":						false,	/* Trap only black souls in black soul gems. */
			"underfilled":					false	/* Trap only souls of the same size in soul gems. */
		},
		"staffExperience":
		{
			"staffExperience":				false,	/* Earn experience when using staves. */
			"ignoreEnchantmentCost":		false	/* Ignore enchantment cost when earning experience using staves. */
		},
		"accumulatingMagnitude":			false,	/* The power of accumulating magnitude magic effects affects the maximum magnitude and not the rate of accumulation. */
		"alreadyCaughtPickpocketing":		false,	/* Pickpocket actors even when you have already been caught. */
		"attachHitEffectArt":				false,	/* Reattach hit effect art when actors reload. */
		"cloakHitEffects":					false,	/* Each of a spells magic effects can attach hit effects even when cast by cloak magic effects. */
		"deferredHitEffects":				true,	/* Attach any number of hit effects to the player while the game is paused. */
		"enchantmentEffectPower":			true,	/* The power of enchantments affects all magic effects. */
		"equipBestAmmunition":				false,	/* Automatically equip the best playable arrows or bolts when equipping bows or crossbows respectively. */
		"leveledCharacters":				false,	/* Very hard leveled characters can be the same level as hard leveled characters. */
		"lockpickingExperience":			true,	/* Earn experience each time a lock is picked. */
		"poisonResistance":					false,	/* Poisons are not always resisted by poison resistance. */
		"powerAttackStamina":				false,	/* Power attacks and bashes can only be performed with the required stamina. */
		"reflectDamage":					true,	/* Reflect any amount of damage. */
		"scrollExperience":					false,	/* Earn experience when using scrolls. */
		"steepSlopes":						false	/* Move slower on slopes than on flat surfaces. Requires the Movement Speed fix in Bug Fixes SSE. */
	}
}
