#pragma once

#include "Shared/PCH.h"

#include "Shared/Skyrim/B/BGSMovementType.h"



namespace Skyrim
{
	class HighProcessData
	{
	public:
		// Member variables
		std::uint64_t         unknown0;         // 0
		std::uint64_t         unknown8;         // 8
		std::uint64_t         unknown10;        // 10
		std::uint64_t         unknown18;        // 18
		std::uint64_t         unknown20;        // 20
		std::uint64_t         unknown28;        // 28
		std::uint64_t         unknown30;        // 30
		std::uint64_t         unknown38;        // 38
		std::uint64_t         unknown40;        // 40
		std::uint64_t         unknown48;        // 48
		std::uint64_t         unknown50;        // 50
		std::uint64_t         unknown58;        // 58
		std::uint64_t         unknown60;        // 60
		std::uint64_t         unknown68;        // 68
		std::uint64_t         unknown70;        // 70
		std::uint64_t         unknown78;        // 78
		std::uint64_t         unknown80;        // 80
		std::uint64_t         unknown88;        // 88
		std::uint64_t         unknown90;        // 90
		std::uint64_t         unknown98;        // 98
		std::uint64_t         unknownA0;        // A0
		std::uint64_t         unknownA8;        // A8
		std::uint64_t         unknownB0;        // B0
		std::uint64_t         unknownB8;        // B8
		std::uint64_t         unknownC0;        // C0
		std::uint64_t         unknownC8;        // C8
		std::uint64_t         unknownD0;        // D0
		std::uint64_t         unknownD8;        // D8
		std::uint64_t         unknownE0;        // E0
		std::uint64_t         unknownE8;        // E8
		BGSMovementType::Data movementTypeData; // F0
		std::uint64_t         unknown130;       // 130
		std::uint64_t         unknown138;       // 138
		std::uint64_t         unknown140;       // 140
		std::uint64_t         unknown148;       // 148
		std::uint64_t         unknown150;       // 150
		std::uint64_t         unknown158;       // 158
		std::uint64_t         unknown160;       // 160
		std::uint64_t         unknown168;       // 168
		std::uint64_t         unknown170;       // 170
		std::uint64_t         unknown178;       // 178
		std::uint64_t         unknown180;       // 180
		std::uint64_t         unknown188;       // 188
		std::uint64_t         unknown190;       // 190
		std::uint64_t         unknown198;       // 198
		std::uint64_t         unknown1A0;       // 1A0
		std::uint64_t         unknown1A8;       // 1A8
		std::uint64_t         unknown1B0;       // 1B0
		std::uint64_t         unknown1B8;       // 1B8
		std::uint64_t         unknown1C0;       // 1C0
		std::uint64_t         unknown1C8;       // 1C8
		std::uint64_t         unknown1D0;       // 1D0
		std::uint64_t         unknown1D8;       // 1D8
		std::uint64_t         unknown1E0;       // 1E0
		std::uint64_t         unknown1E8;       // 1E8
		std::uint64_t         unknown1F0;       // 1F0
		std::uint64_t         unknown1F8;       // 1F8
		std::uint64_t         unknown200;       // 200
		std::uint64_t         unknown208;       // 208
		std::uint64_t         unknown210;       // 210
		std::uint64_t         unknown218;       // 218
		std::uint64_t         unknown220;       // 220
		std::uint64_t         unknown228;       // 228
		std::uint64_t         unknown230;       // 230
		std::uint64_t         unknown238;       // 238
		std::uint64_t         unknown240;       // 240
		std::uint64_t         unknown248;       // 248
		std::uint64_t         unknown250;       // 250
		std::uint64_t         unknown258;       // 258
		std::uint64_t         unknown260;       // 260
		std::uint64_t         unknown268;       // 268
		std::uint64_t         unknown270;       // 270
		std::uint64_t         unknown278;       // 278
		std::uint64_t         unknown280;       // 280
		std::uint64_t         unknown288;       // 288
		std::uint64_t         unknown290;       // 290
		std::uint64_t         unknown298;       // 298
		std::uint64_t         unknown2A0;       // 2A0
		std::uint64_t         unknown2A8;       // 2A8
		std::uint64_t         unknown2B0;       // 2B0
		std::uint64_t         unknown2B8;       // 2B8
		std::uint64_t         unknown2C0;       // 2C0
		std::uint64_t         unknown2C8;       // 2C8
		std::uint64_t         unknown2D0;       // 2D0
		std::uint64_t         unknown2D8;       // 2D8
		std::uint64_t         unknown2E0;       // 2E0
		std::uint64_t         unknown2E8;       // 2E8
		std::uint64_t         unknown2F0;       // 2F0
		std::uint64_t         unknown2F8;       // 2F8
		std::uint64_t         unknown300;       // 300
		std::uint64_t         unknown308;       // 308
		std::uint64_t         unknown310;       // 310
		std::uint64_t         unknown318;       // 318
		std::uint64_t         unknown320;       // 320
		std::uint64_t         unknown328;       // 328
		std::uint64_t         unknown330;       // 330
		std::uint64_t         unknown338;       // 338
		std::uint64_t         unknown340;       // 340
		std::uint64_t         unknown348;       // 348
		std::uint64_t         unknown350;       // 350
		std::uint64_t         unknown358;       // 358
		std::uint64_t         unknown360;       // 360
		std::uint64_t         unknown368;       // 368
		std::uint64_t         unknown370;       // 370
		std::uint64_t         unknown378;       // 378
		std::uint64_t         unknown380;       // 380
		std::uint64_t         unknown388;       // 388
		std::uint64_t         unknown390;       // 390
		std::uint64_t         unknown398;       // 398
		std::uint64_t         unknown3A0;       // 3A0
		std::uint64_t         unknown3A8;       // 3A8
		std::uint64_t         unknown3B0;       // 3B0
		std::uint64_t         unknown3B8;       // 3B8
		std::uint64_t         unknown3C0;       // 3C0
		std::uint64_t         unknown3C8;       // 3C8
		std::uint64_t         unknown3D0;       // 3D0
		std::uint64_t         unknown3D8;       // 3D8
		std::uint64_t         unknown3E0;       // 3E0
		std::uint64_t         unknown3E8;       // 3E8
		std::uint64_t         unknown3F0;       // 3F0
		std::uint64_t         unknown3F8;       // 3F8
		std::uint64_t         unknown400;       // 400
		std::uint64_t         unknown408;       // 408
		std::uint64_t         unknown410;       // 410
		std::uint64_t         unknown418;       // 418
		std::uint64_t         unknown420;       // 420
		std::uint64_t         unknown428;       // 428
		std::uint64_t         unknown430;       // 430
		std::uint64_t         unknown438;       // 438
		std::uint64_t         unknown440;       // 440
		std::uint64_t         unknown448;       // 448
		std::uint64_t         unknown450;       // 450
		std::uint32_t         unknown458;       // 458
		std::uint16_t         unknown45C;       // 45C
		std::uint8_t          unknown45E;       // 45E
		bool                  dualCasting;      // 45F
		std::uint64_t         unknown460;       // 460
		std::uint64_t         unknown468;       // 468
		std::uint64_t         unknown470;       // 470
	};
	static_assert(offsetof(HighProcessData, movementTypeData) == 0xF0);
	static_assert(offsetof(HighProcessData, dualCasting) == 0x45F);
	static_assert(sizeof(HighProcessData) == 0x478);
}
